#Guía 2: SQL

En esta guía usted deberá realizar consultas SQL en un servidor virtual con PostgreSQL que contiene
datos de películas extraídos de IMDb. El esquema de los datos es el siguiente:

* $\color{green}{\textbf{pelicula}}(\color{blue}{\underline{\text{nombre}}}, \color{blue}{\underline{\text{anho}}}, \color{blue}{\text{calificacion}})$ 
* $\color{green}{\textbf{actor}}(\color{blue}{\underline{\text{nombre}}}, \color{blue}{\text{genero}})$
* $\color{green}{\textbf{personaje}}(\color{blue}{\underline{\text{p_nombre}}}, \color{blue}{\underline{\text{p_anho}}},  \color{blue}{\underline{\text{a_nombre}}}, \color{blue}{\text{personaje}})$

La tabla $\color{green}{\textbf{personaje}}$ usa llaves foráneas que hacen referencia a las tablas de $\color{green}{\textbf{actor}}(\color{blue}{\underline{\text{a_nombre}}})$ y $\color{green}{\textbf{pelicula}}(\color{blue}{\underline{\text{p_nombre}}}, \color{blue}{\underline{\text{p_anho}}})$.

Para iniciar el servidor virtual, instalar la base de datos postgres, y descargar los datos e importarlos, debe correr el siguiente bloque:

In [ ]:
# install
!apt update
!apt install postgresql postgresql-contrib &>log
!service postgresql start
!sudo -u postgres psql -c "CREATE USER root WITH SUPERUSER"
# set connection
%load_ext sql
%config SqlMagic.feedback=False 
%config SqlMagic.autopandas=True
%sql postgresql+psycopg2://@/postgres
!wget -cO - https://drive.google.com/uc\?export\=download\&id\=1g7UsolqIt5CatIUiWKQNiQ4sT6zsCZnk > /content/guia2.sql
!psql postgres < /content/guia2.sql
%sql set search_path to guia;

Get:1 http://security.ubuntu.com/ubuntu bionic-security InRelease [88.7 kB]
Get:2 https://cloud.r-project.org/bin/linux/ubuntu bionic-cran40/ InRelease [3,626 B]
Ign:3 https://developer.download.nvidia.com/compute/cuda/repos/ubuntu1804/x86_64  InRelease
Ign:4 https://developer.download.nvidia.com/compute/machine-learning/repos/ubuntu1804/x86_64  InRelease
Get:5 https://developer.download.nvidia.com/compute/cuda/repos/ubuntu1804/x86_64  Release [696 B]
Get:6 http://ppa.launchpad.net/c2d4u.team/c2d4u4.0+/ubuntu bionic InRelease [15.9 kB]
Hit:7 https://developer.download.nvidia.com/compute/machine-learning/repos/ubuntu1804/x86_64  Release
Get:8 https://developer.download.nvidia.com/compute/cuda/repos/ubuntu1804/x86_64  Release.gpg [836 B]
Hit:9 http://archive.ubuntu.com/ubuntu bionic InRelease
Get:10 http://archive.ubuntu.com/ubuntu bionic-updates InRelease [88.7 kB]
Hit:11 http://ppa.launchpad.net/cran/libgit2/ubuntu bionic InRelease
Get:12 http://security.ubuntu.com/ubuntu bionic-security/main amd64 Packages [2,295 kB]
Hit:13 http://ppa.launchpad.net/deadsnakes/ppa/ubuntu bionic InRelease
Get:14 http://archive.ubuntu.com/ubuntu bionic-backports InRelease [74.6 kB]
Hit:15 http://ppa.launchpad.net/graphics-drivers/ppa/ubuntu bionic InRelease
Get:17 https://developer.download.nvidia.com/compute/cuda/repos/ubuntu1804/x86_64  Packages [700 kB]
Get:18 http://ppa.launchpad.net/c2d4u.team/c2d4u4.0+/ubuntu bionic/main Sources [1,796 kB]
Get:19 http://ppa.launchpad.net/c2d4u.team/c2d4u4.0+/ubuntu bionic/main amd64 Packages [919 kB]
Fetched 5,983 kB in 3s (1,779 kB/s)
Reading package lists... Done
Building dependency tree
Reading state information... Done
43 packages can be upgraded. Run 'apt list --upgradable' to see them.
 * Starting PostgreSQL 10 database server
   ...done.
CREATE ROLE

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

--2021-09-06 15:21:08--  https://drive.google.com/uc?export=download&id=1g7UsolqIt5CatIUiWKQNiQ4sT6zsCZnk
Resolving drive.google.com (drive.google.com)... 209.85.145.139, 209.85.145.138, 209.85.145.100, ...
Connecting to drive.google.com (drive.google.com)|209.85.145.139|:443... connected.
HTTP request sent, awaiting response... 302 Moved Temporarily
Location: https://doc-08-3k-docs.googleusercontent.com/docs/securesc/ha0ro937gcuc7l7deffksulhg5h7mbp1/a2te3iu4is9keh42i8mtkg1bc9ovoe5h/1630941600000/16747396958771604789/*/1g7UsolqIt5CatIUiWKQNiQ4sT6zsCZnk?e=download [following]
Warning: wildcards not supported in HTTP.
--2021-09-06 15:21:09--  https://doc-08-3k-docs.googleusercontent.com/docs/securesc/ha0ro937gcuc7l7deffksulhg5h7mbp1/a2te3iu4is9keh42i8mtkg1bc9ovoe5h/1630941600000/16747396958771604789/*/1g7UsolqIt5CatIUiWKQNiQ4sT6zsCZnk?e=download
Resolving doc-08-3k-docs.googleusercontent.com (doc-08-3k-docs.googleusercontent.com)... 173.194.193.132, 2607:f8b0:4001:c0f::84
Connecting to doc-08-3k-docs.googleusercontent.com (doc-08-3k-docs.googleusercontent.com)|173.194.193.132|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 1220212 (1.2M) [text/x-sql]
Saving to: ‘STDOUT’

-                   100%[===================>]   1.16M  --.-KB/s    in 0.01s

2021-09-06 15:21:09 (103 MB/s) - written to stdout [1220212/1220212]

SET
SET
SET
SET
SET
 set_config
------------

(1 row)

SET
SET
SET
SET
CREATE SCHEMA
SET
SET
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
COPY 14676
COPY 250
COPY 17229
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
GRANT
GRANT
GRANT
GRANT
ALTER DEFAULT PRIVILEGES
ALTER DEFAULT PRIVILEGES
 * postgresql+psycopg2://@/postgres

Empty DataFrame
Columns: []
Index: []

Ejecute la siguiente consulta para probar que todo ande bien:

In [ ]:
%sql SELECT * FROM pelicula;

 * postgresql+psycopg2://@/postgres

                                nombre  anho  calificacion
0             The Shawshank Redemption  1994           9.2
1                        The Godfather  1972           9.2
2               The Godfather: Part II  1974           9.0
3                      The Dark Knight  2008           8.9
4                         12 Angry Men  1957           8.9
..                                 ...   ...           ...
245                  The King's Speech  2010           8.0
246                       The Avengers  2012           8.0
247  Lagaan: Once Upon a Time in India  2001           8.0
248               Beauty and the Beast  1991           8.0
249                        Kumonosu-jô  1957           8.0

[250 rows x 3 columns]

Para ejecutar consultas multi-lineas use el tag %%sql:

In [ ]:
%%sql
SELECT * FROM 
pelicula;

 * postgresql+psycopg2://@/postgres

                                nombre  anho  calificacion
0             The Shawshank Redemption  1994           9.2
1                        The Godfather  1972           9.2
2               The Godfather: Part II  1974           9.0
3                      The Dark Knight  2008           8.9
4                         12 Angry Men  1957           8.9
..                                 ...   ...           ...
245                  The King's Speech  2010           8.0
246                       The Avengers  2012           8.0
247  Lagaan: Once Upon a Time in India  2001           8.0
248               Beauty and the Beast  1991           8.0
249                        Kumonosu-jô  1957           8.0

[250 rows x 3 columns]

Ahora, debe diseñar las consultas que resuelvan las siguientes preguntas usando los operadores vistos en clases.

# SQL 

## Pregunta 1
Las películas de los 80s, ordenadas por calificación de mayor a menor.

In [ ]:
%%sql
SELECT * FROM pelicula
WHERE anho BETWEEN 1980 AND 1989
ORDER BY calificacion DESC;

 * postgresql+psycopg2://@/postgres

                                            nombre  anho  calificacion
0   Star Wars: Episode V - The Empire Strikes Back  1980           8.7
1                          Raiders of the Lost Ark  1981           8.5
2                               Back to the Future  1985           8.5
3                            Nuovo Cinema Paradiso  1988           8.4
4                                      The Shining  1980           8.4
5                                   Hotaru no haka  1988           8.4
6                                           Aliens  1986           8.4
7                      Once Upon a Time in America  1984           8.4
8                                         Das Boot  1981           8.3
9       Star Wars: Episode VI - Return of the Jedi  1983           8.3
10                                         Amadeus  1984           8.3
11                               Full Metal Jacket  1987           8.3
12                                        Scarface  1983           8.3
13              Indiana Jones and the Last Crusade  1989           8.3
14                                     Raging Bull  1980           8.2
15                                        Die Hard  1988           8.2
16                                Tonari no Totoro  1988           8.2
17                                             Ran  1985           8.2
18                                    Blade Runner  1982           8.2
19                                The Elephant Man  1980           8.2
20                                       The Thing  1982           8.1
21                                    Idi i smotri  1985           8.1
22                                         Platoon  1986           8.1
23                                     Stand by Me  1986           8.1
24                              The Princess Bride  1987           8.1
25                        Kaze no tani no Naushika  1984           8.1
26                                          Gandhi  1982           8.0
27                                  The Terminator  1984           8.0
28                          Tenkû no shiro Rapyuta  1986           8.0
29                             Fanny och Alexander  1982           8.0

## Pregunta 2
Los nombres de los personajes que ha interpretado su actriz/actor favorito en los datos, ordenados por año.

In [ ]:
%%sql
SELECT personaje FROM personaje
WHERE a_nombre = 'Waltz, Christoph'
ORDER BY p_anho;

 * postgresql+psycopg2://@/postgres

          personaje
0   Col. Hans Landa
1  Dr. King Schultz

# Pregunta 3
Las películas en las que participó su actriz/actor favorito en los datos, ordenadas por calificación de mayor a menor.

In [ ]:
%%sql
SELECT p_nombre, p_anho, calificacion
FROM pelicula P, personaje J
WHERE P.nombre = p_nombre
  AND P.anho = p_anho
  AND a_nombre='Waltz, Christoph'
  ORDER BY P.calificacion DESC;

 * postgresql+psycopg2://@/postgres

               p_nombre  p_anho  calificacion
0      Django Unchained    2012           8.4
1  Inglourious Basterds    2009           8.3

## Pregunta 4
Los nombres de los personajes interpretados por mujeres, en películas de los 90s, con calificación mayor a 8,7.

In [ ]:
%%sql
SELECT personaje
FROM pelicula P, actor A, personaje J
WHERE a_nombre=A.nombre
  AND P.nombre = p_nombre
  AND P.anho = p_anho
  AND p_anho > 1990 AND p_anho < 2000
  AND P.calificacion > 8.7
  AND A.genero = 'F';

 * postgresql+psycopg2://@/postgres

                              personaje
0   Winston Wolfe's Girlfriend At Party
1                            Fourth Man
2                                  Jody
3           Herself - Schindler Mourner
4                           Ghetto Girl
..                                  ...
79                       Bonnie Dimmick
80                       Brinnlitz Girl
81                      Clara Sternberg
82                  Plaszow Jewish Girl
83                         Ghetto Woman

[84 rows x 1 columns]

## Pregunta 5
Las películas de la saga "The Lord of The Rings" (usando el prefijo de su nombre) ordenadas por calificación y por año.

In [ ]:
%%sql
SELECT * FROM pelicula
WHERE nombre LIKE 'The Lord of the Rings%'
ORDER BY calificacion, anho;

 * postgresql+psycopg2://@/postgres

                                              nombre  anho  calificacion
0              The Lord of the Rings: The Two Towers  2002           8.7
1  The Lord of the Rings: The Fellowship of the Ring  2001           8.8
2      The Lord of the Rings: The Return of the King  2003           8.9

## Pregunta 6
Los nombres de los actores que interpretan más de un personaje en la misma película.

In [ ]:
%%sql
SELECT DISTINCT P1.a_nombre
FROM personaje P1, personaje P2
WHERE P1.a_nombre = P2.a_nombre
  AND P1.p_nombre = P2.p_nombre
  AND P1.p_anho=P2.p_anho
  AND P1.personaje <> P2.personaje;

 * postgresql+psycopg2://@/postgres

                a_nombre
0        Abbott, Frankie
1         Abbou, Bernard
2            Adán, Pablo
3      Alazraqui, Carlos
4        Albertson, Jeff
..                   ...
321  Wisher Jr., William
322        Worsham, John
323    Yee, Mitchell (I)
324      Yoshida, Rihoko
325      Young, John (I)

[326 rows x 1 columns]

## Pregunta 7
Las películas en que actúan juntos Uma Thurman y Samuel L. Jackson.

In [ ]:
%%sql
SELECT p_nombre, p_anho FROM personaje
WHERE a_nombre='Thurman, Uma'
INTERSECT
SELECT p_nombre, p_anho FROM personaje
WHERE a_nombre='Jackson, Samuel L.';

 * postgresql+psycopg2://@/postgres

       p_nombre  p_anho
0  Pulp Fiction    1994

## Pregunta 8
Las películas en que actúa Uma Thurman y **no** Samuel L. Jackson.

In [ ]:
%%sql
SELECT p_nombre, p_anho FROM personaje
WHERE a_nombre='Thurman, Uma'
EXCEPT
SELECT p_nombre, p_anho FROM personaje
WHERE a_nombre='Jackson, Samuel L.';

 * postgresql+psycopg2://@/postgres

                   p_nombre  p_anho
0  Kaze no tani no Naushika    1984
1         Kill Bill: Vol. 1    2003

## Pregunta 9
Los pares de actores que aparecen juntos en más de una película. Cada par debe aparecer una sola vez, es decir, si $(A,B)$ aparece, no debe aparecer $(B,A)$, pues es el mismo par. Tampoco se deben incluir pares de la forma $(A,A)$.

In [ ]:
%%sql
SELECT DISTINCT p1.a_nombre,p2.a_nombre
FROM personaje p1,personaje p2,personaje p3,personaje p4
WHERE p1.p_nombre = p2.p_nombre
  AND p1.a_nombre < p2.a_nombre
  AND p3.p_nombre = p4.p_nombre
  AND p1.a_nombre = p3.a_nombre
  AND p2.a_nombre = p4.a_nombre
  AND p1.p_nombre <> p3.p_nombre;

 * postgresql+psycopg2://@/postgres

                  a_nombre          a_nombre
0             Abbink, Marc     McCabe, Orion
1        Acevedo, Gino (I)     Appleby, Noel
2        Acevedo, Gino (I)       Astin, Sean
3        Acevedo, Gino (I)       Baker, Sala
4        Acevedo, Gino (I)        Bean, Sean
...                    ...               ...
5515         Weaving, Hugo  Wood, Elijah (I)
5516         Wenham, David  Wood, Elijah (I)
5517        White, Dan (I)    Wilkerson, Guy
5518  Williams, Robert (I)      Wood, Wilson
5519  Wyler, Catherine (I)       Wyler, Judy

[5520 rows x 2 columns]

## Pregunta 10
La película con calificación más alta.

In [ ]:
%%sql 
SELECT nombre, anho FROM pelicula
EXCEPT
SELECT p1.nombre, p1.anho
FROM pelicula p1, pelicula p2
WHERE p1.calificacion < p2.calificacion;

 * postgresql+psycopg2://@/postgres

                     nombre  anho
0  The Shawshank Redemption  1994
1             The Godfather  1972

# SQL Avanzado

## Pregunta 1
La cantidad de películas

In [ ]:
%%sql
SELECT COUNT(*) AS conteo 
FROM pelicula;

 * postgresql+psycopg2://@/postgres

   conteo
0     250

##Pregunta 2
La cantidad de años distintos de estreno de las películas

In [ ]:
%%sql
SELECT COUNT(DISTINCT anho) AS conteo 
FROM pelicula;

 * postgresql+psycopg2://@/postgres

   conteo
0      81

##Pregunta 3
Los nombres, años y calificaciones de las 10 películas mejor calificadas, ordenadas por calificación descendente, luego por nombre ascendente y luego por año ascendente (solo hay que devolver 10 tuplas, incluso si hay empates de calificación).

In [ ]:
%%sql
SELECT nombre, anho, calificacion 
FROM pelicula 
ORDER BY calificacion DESC, nombre, anho 
LIMIT 10;

 * postgresql+psycopg2://@/postgres

                                          nombre  anho  calificacion
0                                  The Godfather  1972           9.2
1                       The Shawshank Redemption  1994           9.2
2                         The Godfather: Part II  1974           9.0
3                                   12 Angry Men  1957           8.9
4                Il buono, il brutto, il cattivo  1966           8.9
5                                   Pulp Fiction  1994           8.9
6                               Schindler's List  1993           8.9
7                                The Dark Knight  2008           8.9
8  The Lord of the Rings: The Return of the King  2003           8.9
9                                     Fight Club  1999           8.8

##Pregunta 4
Los nombres de los actores y las actrices que aparecen en las películas de la Pregunta 3. Cada actor/actriz solo debe aparecer en los resultados una vez.

In [ ]:
%%sql
SELECT DISTINCT a_nombre 
FROM personaje
  WHERE (p_nombre,p_anho) IN (
    SELECT nombre, anho 
    FROM pelicula 
    ORDER BY calificacion DESC, nombre, anho 
    LIMIT 10 
  );

 * postgresql+psycopg2://@/postgres

              a_nombre
0    Abbott, Jane (II)
1    Acevedo, Gino (I)
2        Aiello, Danny
3         Ajala, David
4     Alagich, Richard
..                 ...
867        Zahir, Essa
868        Zahrn, Will
869    Zaideman, Kevin
870      Ziehm, Rainer
871       Zinn, Donald

[872 rows x 1 columns]

##Pregunta 5
Los nombres de solo las actrices de las películas de la Pregunta 4. Cada actriz debe aparecer en los resultados solo una vez.

In [ ]:
%%sql
SELECT DISTINCT a_nombre FROM personaje
  WHERE (p_nombre,p_anho) IN (
    SELECT nombre,anho 
    FROM pelicula 
    ORDER BY calificacion DESC, nombre, anho 
    LIMIT 10 
  ) AND a_nombre IN (
	SELECT nombre 
	FROM actor 
	WHERE genero='F'
  );

 * postgresql+psycopg2://@/postgres

                 a_nombre
0       Abbott, Jane (II)
1         Aldaz, Tracy L.
2             Allman, Cie
3           Alonso, Chelo
4        Arquette, Alexis
..                    ...
160       Wolf, Lisa (IV)
161  Wyrobiec-Bank, Lidia
162      Yerushalmi, Esti
163           Yohn, Erica
164        Zabawa, Lucyna

[165 rows x 1 columns]

##Pregunta 6
Las distintas décadas de las películas en las cuales apareció Clint Eastwood. (Tiene tres resultados; uno es 1960.)

In [ ]:
%%sql
SELECT DISTINCT p_anho - p_anho%10 AS decada
FROM personaje 
WHERE a_nombre='Eastwood, Clint';

 * postgresql+psycopg2://@/postgres

   decada
0    1960
1    1990
2    2000

##Pregunta 7
El conteo de películas distintas por año (para cada año en la tabla pelicula, devolver su conteo de películas).

In [ ]:
%%sql
SELECT anho, COUNT(DISTINCT (nombre, anho)) AS conteo -- DISTINCT no es necesario, pero está bien
FROM pelicula 
GROUP BY anho;

 * postgresql+psycopg2://@/postgres

    anho  conteo
0   1921       1
1   1925       1
2   1926       1
3   1927       2
4   1928       1
..   ...     ...
76  2012       5
77  2013       4
78  2014       8
79  2015       7
80  2016       2

[81 rows x 2 columns]

##Pregunta 8
Devuelva los mismos resultados como en la Pregunta 7, pero ordenados por conteo descendente y borrando los años cuyo conteo sea menor que 2.

In [ ]:
%%sql
SELECT anho, COUNT(DISTINCT(nombre,anho)) AS conteo
FROM pelicula 
GROUP BY anho 
HAVING COUNT(nombre) >1 
ORDER BY conteo DESC;

 * postgresql+psycopg2://@/postgres

    anho  conteo
0   1995       9
1   1957       8
2   2014       8
3   2001       7
4   2015       7
..   ...     ...
57  1992       2
58  1927       2
59  1964       2
60  1963       2
61  1996       2

[62 rows x 2 columns]

##Pregunta 9
Sea una buena película una película con una calificación $\geq 8{,}6$. Para cada actor/actriz, cuente sus distintas buenas películas. Si un actor/una actriz no tiene una buena película, se puede omitirlo/la de los resultados. Ordene los resultados por conteo descendente.

In [ ]:
%%sql
SELECT a_nombre, COUNT(DISTINCT(nombre,anho)) AS conteo
FROM personaje
JOIN pelicula
  ON nombre = p_nombre 
    AND anho = p_anho
    AND calificacion > 8.5
GROUP BY a_nombre
ORDER BY conteo DESC;

 * postgresql+psycopg2://@/postgres

                   a_nombre  conteo
0             Weaving, Hugo       4
1               Astin, Sean       3
2         Monaghan, Dominic       3
3      Lee, Christopher (I)       3
4           Boyd, Billy (I)       3
...                     ...     ...
2132       Bates, Billy (I)       1
2133         Batista, Diego       1
2134  Batista, Leandro Dias       1
2135            Bau, Joseph       1
2136            Bau, Rebeka       1

[2137 rows x 2 columns]

##Pregunta 10
Cuente el número de actrices distintas por película. De haber una película sin actrices, deje un conteo de 0 (en vez de omitir la película).

In [ ]:
%%sql 
SELECT p_nombre, COUNT(DISTINCT(nombre)) AS conteo
FROM personaje
  LEFT JOIN actor
    ON a_nombre = nombre AND genero = 'F'
GROUP BY p_nombre
ORDER BY conteo DESC;

 * postgresql+psycopg2://@/postgres

                                         p_nombre  conteo
0                         The Wolf of Wall Street      94
1                             Catch Me If You Can      66
2                             Singin' in the Rain      65
3    Harry Potter and the Deathly Hallows: Part 2      55
4                           The Dark Knight Rises      55
..                                            ...     ...
245                                Paths of Glory       1
246                            Lawrence of Arabia       1
247                                     The Thing       1
248                              The Great Escape       0
249                                  12 Angry Men       0

[250 rows x 2 columns]